Hasnaoui-Youssef/trailer_vibes/test_resources/xml/stm32h7rs.pdsc
<?xml version="1.0" encoding="UTF-8"?>
<package schemaVersion="1.7.36" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="https://raw.githubusercontent.com/Open-CMSIS-Pack/Open-CMSIS-Pack-Spec/v1.7.36/schema/PACK.xsd">
  <vendor>Keil</vendor>
  <name>STM32H7RSxx_DFP</name>
  <description overview="Documents/OVERVIEW.md">STMicroelectronics STM32H7RSxx Series Device Support</description>
  <url>https://www.keil.com/pack/</url>
  <repository type="git">https://github.com/Open-CMSIS-Pack/STM32H7RSxx_DFP.git</repository>
  <license>LICENSES</license>
  <licenseSets>
    <licenseSet id="all" default="true" gating="true">
      <license title="Apache-2.0 License for CMSIS add-ons"                  name="LICENSE-Apache-2.0"   spdx="Apache-2.0"/>
      <license title="BSD-3-Clause License for STMicroelectronics STM32 HAL" name="LICENSE-BSD-3-Clause" spdx="BSD-3-Clause"/>
    </licenseSet>
  </licenseSets>

  <releases>
    <release version="1.1.1-dev">
      Active development...
    </release>
  </releases>

  <keywords>
    <keyword>ST</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package STMicroelectronics</keyword>
    <keyword>STM32H7RS</keyword>
    <keyword>STM32H7RSxx</keyword>
  </keywords>

  <devices>
    <family Dfamily="STM32H7RS Series" Dvendor="STMicroelectronics:13">
      <processor Dcore="Cortex-M7" DcoreVersion="r0p1" Dclock="550000000" Dmpu="MPU" Dfpu="DP_FPU" Dendian="Little-endian" Ddsp="DSP"/>
      <debugconfig default="swd" swj="true" clock="5000000" sdf="CMSIS/Debug/STM32H7Rx_7Sx.sdf"/>

      <description>
High-performance STM32H7 MCUs with Arm Cortex-M7 core, MPU, L1 cache, DSP, DP-FPU, 1284 DMIPS at 600 MHz.
      </description>

      <book name="https://developer.arm.com/documentation/dui0646/latest" title="Cortex-M7 Generic User Guide"/>
      <book name="https://www.st.com/resource/en/reference_manual/rm0477-stm32h7rx7sx-armbased-32bit-mcus-stmicroelectronics.pdf" title="STM32H7Rx/Sx Arm-based 32-bit MCUs Reference Manual"/>

      <algorithm name="CMSIS/Flash/MX66UW1G45G_STM32H7S78-DK.FLM"        start="0x70000000" size="0x08000000" RAMstart="0x20000000" RAMsize="0x00010000"  default="0" />
      <algorithm name="CMSIS/Flash/MX25UW25645G_STM32H7S38-NUCLEO.FLM"   start="0x70000000" size="0x02000000" RAMstart="0x20000000" RAMsize="0x00010000"  default="0" />
      <algorithm name="CMSIS/Flash/MX66UW1G45G_STM32H7S78-DK-XSPIM1.FLM" start="0x90000000" size="0x08000000" RAMstart="0x20000000" RAMsize="0x00010000" default="0" />

      <debugvars configfile="CMSIS/Debug/STM32H7Rx_7Sx.dbgconf" version="1.0.1">
        // Default values for variables in debug sequences are configured with a *.dbgconf file in the user project
        __var DbgMCU_CR        = 0x00000007;   // DBGMCU_CR:       DBGMCU configuration register
                                               //                  [21] DBGCKEN, [20] TRACECLKEN
                                               //                  [ 2] DBGSTBY, [ 1] DBGSTOP,  [ 0] DBGSLEEP
        __var DbgMCU_AHB5_Fzr  = 0x0000FFFF;   // DBGMCU_AHB5FZR:  DBGMCU AHB5 peripheral freeze register
        __var DbgMCU_AHB1_Fzr  = 0x0000FFFF;   // DBGMCU_AHB1FZR:  DBGMCU AHB1 peripheral freeze register
        __var DbgMCU_APB1_Fzr  = 0x00E00BFF;   // DBGMCU_APB1FZR:  DBGMCU APB1 peripheral freeze register
        __var DbgMCU_APB2_Fzr  = 0x000F0001;   // DBGMCU_APB2FZR:  DBGMCU APB2 peripheral freeze register
        __var DbgMCU_APB4_Fzr  = 0x00041E00;   // DBGMCU_APB4FZR:  DBGMCU APB4 peripheral freeze register
        __var TraceClk_Pin     = 0x00040002;   // PE2
        __var TraceD0_Pin      = 0x00040003;   // PE3
        __var TraceD1_Pin      = 0x00040004;   // PE4
        __var TraceD2_Pin      = 0x00040005;   // PE5
        __var TraceD3_Pin      = 0x00040006;   // PE6
      </debugvars>

      <sequences>
        <!-- Override for Pre-Defined Sequences -->
        <sequence name="DebugDeviceUnlock">
          <block>
            __var value = 0;

            Sequence("CheckID");

            __ap   = 0;                                         // Switch to System Debug Access Port

            value  = Read32(0xE00E1004);                        // Read DBGMCU_CR
            value |= 0x00200000;                                // set preset values (enable all debug clocks by default)
                                                                // DBGMCU_CR: [21] DBGCKEN
          </block>

          <control if="__traceout"> <!-- Enable Trace Clock and hence access to global trace components now -->
            <block>
              value |= 0x00100000;                              // DBGMCU_CR[20] TRACECLKEN
            </block>
          </control>

          <block>
            Write32(0xE00E1004, value);                         // Update DBGMCU_CR
          </block>

          <block info="DbgMCU registers">
            Write32(0xE00E1004 , DbgMCU_CR        | value);     // DBGMCU_CR:       Configure MCU Debug
            Write32(0xE00E101C , DbgMCU_AHB5_Fzr         );     // DBGMCU_AHB5FZR:  Configure DBGMCU AHB5 peripheral freeze behavior
            Write32(0xE00E1024 , DbgMCU_AHB1_Fzr         );     // DBGMCU_AHB1FZR:  Configure DBGMCU AHB1 peripheral freeze behavior
            Write32(0xE00E103C , DbgMCU_APB1_Fzr         );     // DBGMCU_APB1FZR:  Configure DBGMCU APB1 peripheral freeze behavior
            Write32(0xE00E104C , DbgMCU_APB2_Fzr         );     // DBGMCU_APB2FZR:  Configure DBGMCU APB2 peripheral freeze behavior
            Write32(0xE00E1054 , DbgMCU_APB4_Fzr         );     // DBGMCU_APB4FZR:  Configure DBGMCU APB4 peripheral freeze behavior
          </block>
        </sequence>

        <sequence name="TraceStart">
          <block>
            __var traceSWO    = (__traceout &amp; 0x1) != 0;                               // SWO (asynchronous) Trace Selected?
            __var traceTPIU   = (__traceout &amp; 0x2) != 0;                               // TPIU (synchronous) Trace Selected?
          </block>

