Hasnaoui-Youssef/trailer_vibes/test_resources/xml/stm32h7rs.pdsc
      <!-- ************************  Subfamily 'STM32H7R3'  **************************** -->
      <subFamily DsubFamily="STM32H7R3">
        <debug __ap="1" svd="CMSIS/SVD/STM32H7R.svd"/>
        <compile define="STM32H7R3xx"/>

        <book name="https://www.st.com/resource/en/datasheet/stm32h7r3a8.pdf" title="STM32H7R3x8 STM32H7R7x8 Datasheet"/>

        <!-- default memory configuration.
             Optionbyte settings: FLASH_OBW2SR.ECC_ON_SRAM = 0
                                  FLASH_OBW2SR.DTCM_AXI_SHARE = 0
                                  FLASH_OBW2SR.ITCM_AXI_SHARE = 0      -->
        <memory name="ITCM_RAM"   access="rwx" start="0x00000000" size="0x00010000" init="0" default="0" />
        <memory name="DTCM_RAM"   access="rw"  start="0x20000000" size="0x00010000" init="0" default="0" />
        <memory name="AXI_SRAM"   access="rwx" start="0x24000000" size="0x00072000" init="0" default="1" />
        <memory name="AHB_SRAM"   access="rw"  start="0x30000000" size="0x00008000" init="0" default="1" />
        <memory name="BKP_SRAM"   access="rw"  start="0x38800000" size="0x00001000" init="0" default="0" />

        <!-- ################################### 64 KB ################################## -->
        <!-- *************************  Device 'STM32H7R3R8Vx  ***************************** -->
        <device Dname="STM32H7R3R8Vx">
          <memory name="Flash" access="rx"                start="0x08000000" size="0x00010000" startup="1" default="1" />
          <algorithm name="CMSIS/Flash/STM32H7Rx_64k.FLM" start="0x08000000" size="0x00010000" RAMstart="0x20000000" RAMsize="0x00010000" default="1" />

          <feature type="QFP" n="68"/>
        </device>

        <!-- *************************  Device 'STM32H7R3V8Tx  ***************************** -->
        <device Dname="STM32H7R3V8Tx">
          <memory name="Flash" access="rx"                start="0x08000000" size="0x00010000" startup="1" default="1" />
          <algorithm name="CMSIS/Flash/STM32H7Rx_64k.FLM" start="0x08000000" size="0x00010000" RAMstart="0x20000000" RAMsize="0x00010000" default="1" />

          <feature type="QFP" n="100"/>
        </device>

        <!-- *************************  Device 'STM32H7R3Z8Tx  ***************************** -->
        <device Dname="STM32H7R3Z8Tx">
          <memory name="Flash"     access="rx" start="0x08000000" size="0x00010000" startup="1" default="1" />
          <algorithm name="CMSIS/Flash/STM32H7Rx_64k.FLM" start="0x08000000" size="0x00010000" RAMstart="0x20000000" RAMsize="0x00010000" default="1" />

          <feature type="QFP" n="144"/>
        </device>

        <!-- *************************  Device 'STM32H7R3I8Tx  ***************************** -->
        <device Dname="STM32H7R3I8Tx">
          <memory name="Flash" access="rx"                start="0x08000000" size="0x00010000" startup="1" default="1" />
          <algorithm name="CMSIS/Flash/STM32H7Rx_64k.FLM" start="0x08000000" size="0x00010000" RAMstart="0x20000000" RAMsize="0x00010000" default="1" />

          <feature type="QFP" n="176"/>
        </device>

        <!-- *************************  Device 'STM32H7R3V8Yx  ***************************** -->
        <device Dname="STM32H7R3V8Yx">
          <memory name="Flash" access="rx"                start="0x08000000" size="0x00010000" startup="1" default="1" />
          <algorithm name="CMSIS/Flash/STM32H7Rx_64k.FLM" start="0x08000000" size="0x00010000" RAMstart="0x20000000" RAMsize="0x00010000" default="1" />

          <feature type="CSP" n="101"/>
        </device>

        <!-- *************************  Device 'STM32H7R3V8Hx  ***************************** -->
        <device Dname="STM32H7R3V8Hx">
          <memory name="Flash" access="rx"                start="0x08000000" size="0x00010000" startup="1" default="1" />
          <algorithm name="CMSIS/Flash/STM32H7Rx_64k.FLM" start="0x08000000" size="0x00010000" RAMstart="0x20000000" RAMsize="0x00010000" default="1" />

          <feature type="BGA" n="100"/>
        </device>

        <!-- *************************  Device 'STM32H7R3Z8Jx  ***************************** -->
        <device Dname="STM32H7R3Z8Jx">
          <memory name="Flash" access="rx"                start="0x08000000" size="0x00010000" startup="1" default="1" />
          <algorithm name="CMSIS/Flash/STM32H7Rx_64k.FLM" start="0x08000000" size="0x00010000" RAMstart="0x20000000" RAMsize="0x00010000" default="1" />

          <feature type="BGA" n="144"/>
        </device>

        <!-- *************************  Device 'STM32H7R3A8Ix  ***************************** -->
        <device Dname="STM32H7R3A8Ix">
          <memory name="Flash" access="rx"                start="0x08000000" size="0x00010000" startup="1" default="1" />
          <algorithm name="CMSIS/Flash/STM32H7Rx_64k.FLM" start="0x08000000" size="0x00010000" RAMstart="0x20000000" RAMsize="0x00010000" default="1" />

          <feature type="BGA" n="169"/>
        </device>

        <!-- *************************  Device 'STM32H7R3I8Kx  ***************************** -->
        <device Dname="STM32H7R3I8Kx">
          <memory name="Flash" access="rx"                start="0x08000000" size="0x00010000" startup="1" default="1" />
          <algorithm name="CMSIS/Flash/STM32H7Rx_64k.FLM" start="0x08000000" size="0x00010000" RAMstart="0x20000000" RAMsize="0x00010000" default="1" />

          <feature type="BGA" n="176"/>
        </device>

        <!-- *************************  Device 'STM32H7R3L8Hx  ***************************** -->
        <device Dname="STM32H7R3L8Hx">
          <memory name="Flash" access="rx"                start="0x08000000" size="0x00010000" startup="1" default="1" />
          <algorithm name="CMSIS/Flash/STM32H7Rx_64k.FLM" start="0x08000000" size="0x00010000" RAMstart="0x20000000" RAMsize="0x00010000" default="1" />

          <feature type="BGA" n="225"/>
        </device>

        <!-- *************************  Device 'STM32H7R3L8HxH  **************************** -->
        <device Dname="STM32H7R3L8HxH">
          <memory name="Flash" access="rx"                start="0x08000000" size="0x00010000" startup="1" default="1" />
          <algorithm name="CMSIS/Flash/STM32H7Rx_64k.FLM" start="0x08000000" size="0x00010000" RAMstart="0x20000000" RAMsize="0x00010000" default="1" />

          <feature type="BGA" n="225"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32H7S3'  **************************** -->
      <subFamily DsubFamily="STM32H7S3">
        <debug __ap="1" svd="CMSIS/SVD/STM32H7S.svd"/>
        <compile define="STM32H7S3xx"/>

